//2. Користувач вводить число (використовуйте prompt ()). Необхідно перевірити чи є введене число
	//a) парним додатним;
	//b) кратним числу 7.
//Результат перевірки вивести в консоль.

//а)
let number1 = prompt('Ввведіть число');

if (number1 > 0 && number1 % 2 == 0) {
    console.log('Число є парним додатним');
} else {
    console.log('Це число нам не підходить');
}

//b)
let number2 = prompt('Ввведіть число');

if (number2 % 7 == 0) {
    console.log('Число є кратним 7');
} else {
    console.log('Це число нам не підходить');
}

