// 6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
// Необхідно 
// 	a) визначити і вивести в консоль площу трикутника 
// 	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
// Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. 
// Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми 
// (наприклад:  8.42355465 =>  8.424).

let a = parseInt( prompt('Введіть значення першої сторони трикутника') );
let b = parseInt( prompt('Введіть значення другої сторони трикутника') );
let c = parseInt( prompt('Введіть значення третьої сторони трикутника') );
let semiPerimeter = (a + b + c) / 2;
let squre = Math.sqrt( semiPerimeter * (semiPerimeter - a) * (semiPerimeter - b) * (semiPerimeter - c) );

if (a <= 0 || b <= 0 || c <= 0 ) {
    alert('Incorrect data! Всі значення мають бути більше нуля');
} else if ( isNaN(a) == true || isNaN(b) == true || isNaN(c) == true) {
    alert('Incorrect data! Довжина має бути цифрою');
} else if ( (a + b < c) || (a + c < b) || (c + b < a)) {
    alert('Incorrect data! Сума довжин двох відрізків має бути більшою довжини третього відрізка');
} else if ( Math.pow(a,2) + Math.pow(b,2) == Math.pow(c,2) || Math.pow(a,2) + Math.pow(c,2) == Math.pow(b,2) || Math.pow(c,2) + Math.pow(b,2) == Math.pow(a,2) ) {
    alert('Вітаємо, трикутник прямокутний');
} else {
    console.log( `Площа трикутника становить ${squre.toFixed(3)}`);
}